package com.example.demo.test.demo.String;

import java.io.IOException;
import java.util.ArrayList;
import java.util.List;

public class StringUtil {
	public static void main(String[] args) throws IOException {
		String str = "巴氏杀菌乳|灭菌乳|调制乳|发酵乳|风味发酵乳|乳粉|奶油粉|调制乳粉|调制奶油粉|淡炼乳原味|调制炼乳|加糖炼乳|使用了非乳原料的调制炼乳|稀奶油|调制稀奶油|稀奶油品|非熟化干酪|熟化干酪|乳清干酪|普通再制干酪|调味再制干酪|干酪品|乳清蛋白干酪|以乳为主要配料的即食风味食品|冰淇淋|乳制品|乳清粉酪蛋白粉|植物油|氢化植物油|动物油脂|猪油|牛油|鱼油|动物脂肪|无水黄油|无水乳脂|黄油|浓缩黄油|人造黄油|人造奶油|黄油|人造黄油混合品|乳化制品|脂肪乳化制品|脂肪乳化制品|脂肪甜品|油脂|油脂制品|冰淇淋|雪糕|风味冰|冰棍|食用冰|冷冻饮品|未经加工的鲜果|经表面处理的鲜水果|去皮或预切的鲜水果|冷冻水果|水果干|醋|油|盐渍水果|水果罐头|果酱|果泥|印度酸辣酱|蜜饯|凉果|果脯|话化|果糕|装饰性果蔬|水果甜品|果味液体甜品|发酵的水果制品|煮熟的或油炸的水果|加工水果|未经加工鲜蔬菜|经表面处理的新鲜蔬菜|去皮切块或切丝的蔬菜|豆芽菜|冷冻蔬菜|干制蔬菜|腌渍的蔬菜|蔬菜罐头|蔬菜泥|酱|番茄沙司|发酵蔬菜制品|经水煮或油炸的蔬菜|加工蔬菜|未经加工鲜食用菌|藻|经表面处理的鲜食用菌|去皮切块或切丝的食用菌|冷冻食用菌|干制食用菌|腌渍的食用菌|食用菌|罐头|经水煮或油炸的藻|加工食用菌|豆腐|豆干|炸制半干豆腐|卤制半干豆腐|熏制半干豆腐|半干豆腐|腐竹包括腐竹油皮|新型豆制品大豆蛋白|膨化食品大豆素肉|熟制豆|腐乳|豆豉|制品包括纳豆|豆制品|新鲜坚果与籽|带壳熟制坚果与籽|脱壳熟制坚果与籽|坚果与籽罐头|坚果与籽的泥酱包括花生酱|加工的坚果与籽如腌渍的果仁|可可制品包括以可可为主要原料的脂粉浆酱馅|巧克力|巧克力制品除以外的可可制品|代可可脂巧克力|使用可可脂代用品的巧克力产品|葡萄酒|胶基糖果|除胶基糖果以外的糖果|糖果|巧克力制品包衣|装饰糖果|用于蛋糕装饰顶饰非水果材料|甜汁|原粮|大米|大米制品|米粉|汤圆粉|米粉制品|通用小麦粉|专用小麦粉|自发粉饺子粉|生湿面制品|面条|饺子皮|馄饨皮|烧麦皮|生干面制品|发酵面制品|面糊|鱼|禽肉的拖面糊裹粉煎炸粉|油炸面制品|杂粮粉|杂粮罐头|杂粮制品|食用淀粉|粉丝粉条|虾味片|藕粉|粉圆|即食谷物|碾轧燕麦片|方便米面制品|冷冻米面制品|谷|淀粉甜品|米布丁|木薯布丁|布丁|粮食制品|馅料|面包|中式糕点|月饼|西式糕点|月饼|糕点上彩装|夹心|装饰饼干|威化饼干|蛋卷|饼干|焙烤食品馅料|表面用挂浆|焙烤食品|生鲜肉|冷却肉|排酸肉|冰鲜肉|冷鲜肉|冻肉|调理肉制品生肉添加调理料|腌腊肉制品|咸肉|腊肉|板鸭|中式火腿腊肠|白煮肉|酱卤肉|糟肉|熏烧烤肉|油炸肉|西式火腿熏烤烟熏蒸煮火腿|肉灌肠|发酵肉制品|肉松|肉干|肉脯|肉罐头|熟肉制品|肉制品的可食用动物肠衣|鲜水产|冷冻水产品|冷冻挂桨制品|冷冻鱼糜制品包括鱼丸|醋渍或肉冻状水产品|腌制水产品|鱼子制品|风干烘干压干水产品|预制水产品|鱼肉饺皮|熟干水产品|经烹调或油炸的水产品|熏烤水产品|发酵水产品|鱼肉灌肠|水产品罐头|水产品|制品|鲜蛋|卤蛋|糟蛋|皮蛋|咸蛋|再制蛋|脱水蛋制品|蛋白粉|蛋黄粉|蛋白片|热凝固蛋制品|蛋黄酪|松花蛋肠|蛋液与液体蛋|蛋制品|白糖|白糖制品|白砂糖|绵白糖|冰糖|方糖|糖|糖浆|红糖|赤砂糖|冰片糖|原糖|果糖|蔗糖|来源糖蜜部分转化糖|槭树糖浆|淀粉|糖果糖|葡萄糖|饴糖部分转化糖|蜂蜜|花粉|餐桌甜味料|水果调味糖浆|调味糖浆|甜味料|盐|代盐制品|鲜味剂|助鲜剂|酿造食醋|配制食醋|酿造酱油|配制酱油|酿造酱|配制酱|料酒|香辛料|粉|香辛料油|香辛料酱|芥末酱|青芥酱|香辛料加工品|固体汤料|鸡精|鸡粉|固体复合调味料|蛋黄酱|沙拉酱|以动物性原料为基料的调味酱|以蔬菜为基料的调味酱|半固体复合调味料|浓缩汤罐装瓶装|肉汤骨汤|调味清汁|蚝油虾油鱼露|调味料|婴儿配方食品|较大婴儿|幼儿配方食品|特殊医学用途婴儿配方食品|婴幼儿谷辅助食品|婴幼儿罐装辅助食品|特殊膳食用食品|饮用天然矿泉水|饮用纯净水|饮用水|果蔬汁浆|浓缩果蔬汁浆|果蔬汁浆饮料|发酵型含乳饮料|配制型含乳饮料|乳酸菌饮料|植物蛋白饮料|复合蛋白饮料|蛋白饮料|可乐型碳酸饮料|型碳酸饮料|茶饮料|咖啡饮料|植物饮料|蛋白固体饮料|速溶咖啡|固体饮料|特殊用途饮料|风味饮料|饮料|白酒|调香蒸馏酒|白兰地|威士忌|伏特加|朗姆酒|蒸馏酒|配制酒|无汽葡萄酒|起泡|半起泡葡萄酒|调香葡萄酒|特种葡萄酒按特殊工艺加工制作的葡萄酒|在葡萄原酒中加入白兰地浓缩葡萄汁|黄酒|果酒|蜂蜜酒|啤酒|麦芽饮料|发酵酒充气型|果冻|茶叶咖啡|茶制品包括调味茶|代用茶|胶原蛋白肠衣|干酵母|酵母|酵母制品|膨化食品|干酪|饮品|水果";
		String [] str1 =  str.split("\\|");
		
		str = "";
		List <String> list = new ArrayList<String>();
		for (int i = 0; i < str1.length; i++) {
			if (!list.contains(str1[i])) {
				
				list.add(str1[i]);
			}
			else {
				System.out.println(str1[i]);
			}
		
		}
		
		String [] strs = null ;
		strs = list.toArray(new String [0]);
		System.out.println(str1.length);
		System.out.println(strs.length);
		for (int i = 0; i < strs.length; i++) {
			str +=strs[i];
			str +="|";
		}
		System.out.println(str);
	}
}





